Revit 2027 API
DisplacementElement.GetRelativeDisplacement Method
 The relative displacement applied to the displaced elements by this DisplacementElement.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public XYZ GetRelativeDisplacement()
Public Function GetRelativeDisplacement As XYZ
public:
XYZ^ GetRelativeDisplacement()
member GetRelativeDisplacement : unit -> XYZ
Return Value
XYZ
 The relative displacement.
See Also
Reference
DisplacementElement Class
Autodesk.Revit.DB Namespace